#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт 

	ЮТТесты
		.ДобавитьТестовыйНабор("ПолучениеСсылкиПоОбъектуXDTO")

		.ДобавитьСерверныйТест("ПолучитьСсылкуПоСлучайномуИдентификатору", "- по новому ГУИД")
		.ДобавитьСерверныйТест("ПолучитьСсылкуПоСлучайномуИдентификаторуССозданием", "- по новому ГУИД (с созданием)")

		.ДобавитьСерверныйТест("ПолучитьСсылкуПоИдентификаторуСуществующего", "- по ГУИД ссылки на существующий элемент такого же типа")
		.ВТранзакции()

		.ДобавитьСерверныйТест("ПолучитьСсылкуПоИдентификаторуСуществующегоИногоТипа", "- по ГУИД ссылки на существующий элемент иного типа")
		.ВТранзакции()

		.ДобавитьСерверныйТест("ПолучитьСсылкуПоСлучайномуИдентификаторуПоТипуОбъекта", "- по новому ГУИД (с созданием). Поле ""TypeName"" в объекте XDTO соответствует запрашиваему типу")
		.СПараметрамиНаСервере("CashFlowItems")

		.ДобавитьСерверныйТест("ПолучитьСсылкуПоСлучайномуИдентификаторуПоТипуОбъекта", "- по новому ГУИД (с созданием). Поле ""TypeName"" в объекте XDTO не соответствует запрашиваему типу")
		.СПараметрамиНаСервере("StageOfLimitsForEmployees");

КонецПроцедуры

Процедура ПолучитьСсылкуПоСлучайномуИдентификатору() Экспорт

	ОбъектXDTO = ЮТест.Данные()
		.КонструкторОбъектаXDTO("Object", "http://www.sample-package.org")
		.Установить("ID", Новый УникальныйИдентификатор)
		.ДанныеОбъекта();

	Результат = LimitsForEmployeesServer.ДО_ПолучитьСсылкуПоОбъектуXDTO(ОбъектXDTO, "Catalog.ДО_СтатьиДвиженияДенежныхСредств");

	ЮТест
		.ОжидаетЧто(Результат, "Ссылка не определена")
		.НеЗаполнено("Проверка, что значение не заполнено");

КонецПроцедуры

Процедура ПолучитьСсылкуПоСлучайномуИдентификаторуССозданием() Экспорт

	ОбъектXDTO = ЮТест.Данные()
		.КонструкторОбъектаXDTO("Object", "http://www.sample-package.org")
		.Установить("ID", Новый УникальныйИдентификатор)
		.ДанныеОбъекта();

	Результат = LimitsForEmployeesServer.ДО_ПолучитьСсылкуПоОбъектуXDTO(ОбъектXDTO, "Catalog.ДО_СтатьиДвиженияДенежныхСредств", Истина);

	ЮТест
		.ОжидаетЧто(Результат, "Ссылка определена")
		.Заполнено("Проверка, что значение заполнено")
		.ИмеетТип("СправочникСсылка.ДО_СтатьиДвиженияДенежныхСредств");
	
КонецПроцедуры

Процедура ПолучитьСсылкуПоИдентификаторуСуществующего() Экспорт

	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ДО_СтатьиДвиженияДенежныхСредств);
	ОбъектXDTO = ЮТест.Данные()
		.КонструкторОбъектаXDTO("Object", "http://www.sample-package.org")
		.Установить("ID", Ссылка.УникальныйИдентификатор())
		.ДанныеОбъекта();

	Результат = LimitsForEmployeesServer.ДО_ПолучитьСсылкуПоОбъектуXDTO(ОбъектXDTO, "Catalog.ДО_СтатьиДвиженияДенежныхСредств");

	ЮТест
		.ОжидаетЧто(Результат, "Ссылка определена")
		.Заполнено("Проверка, что значение заполнено")
		.ИмеетТип("СправочникСсылка.ДО_СтатьиДвиженияДенежныхСредств")
		.Равно(Ссылка);

КонецПроцедуры

Процедура ПолучитьСсылкуПоИдентификаторуСуществующегоИногоТипа() Экспорт

	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ДО_Организации);
	ОбъектXDTO = ЮТест.Данные()
		.КонструкторОбъектаXDTO("Object", "http://www.sample-package.org")
		.Установить("ID", Ссылка.УникальныйИдентификатор())
		.ДанныеОбъекта();

	Результат = LimitsForEmployeesServer.ДО_ПолучитьСсылкуПоОбъектуXDTO(ОбъектXDTO, "Catalog.ДО_СтатьиДвиженияДенежныхСредств");

	ЮТест
		.ОжидаетЧто(Результат, "Ссылка не определена")
		.НеЗаполнено("Проверка, что значение не заполнено");

КонецПроцедуры

Процедура ПолучитьСсылкуПоСлучайномуИдентификаторуПоТипуОбъекта(ИмяТипаОбъекта) Экспорт

	ОбъектXDTO = ЮТест.Данные()
		.КонструкторОбъектаXDTO("Object", "http://www.sample-package.org")
		.Установить("ID", Новый УникальныйИдентификатор)
		.Установить("TypeName", ИмяТипаОбъекта)
		.ДанныеОбъекта();

	Результат = LimitsForEmployeesServer.ДО_ПолучитьСсылкуПоОбъектуXDTO(ОбъектXDTO, "Catalog.ДО_СтатьиДвиженияДенежныхСредств", Истина);

	ЮТест
		.ОжидаетЧто(Результат, "Ссылка определена")
		.Заполнено("Проверка, что значение заполнено")
		.ИмеетТип("СправочникСсылка.ДО_СтатьиДвиженияДенежныхСредств");
	
КонецПроцедуры

#КонецОбласти